org/reference/the_economic_cycle.org
:PROPERTIES:
:ID:       83ec5164-9a32-4baa-bdb7-c5850c3a0b0c
:END:
#+title: The Economic Cycle

- Currently in long-term secular uptrend because of:
  - macro environment
  - corporate growth
  - the borrowing mentality
  - popularization of investing
  - investor psychology

The output of an economy is the product of *hours worked* and *rate of work
done*. These are affected by fundamental factors like birth rate which change
little from year to year.

Factors affecting short-term trend:

- Willingness to work (market conditions etc.)
- Fear of spending
- Amount of wealth: consumers are unlikely to fund consumption by selling stocks or homes

Most economic forecasts are just extrapolations of current trends: they are
usually correct but not valuable. Unconventional forecasts (e.g. predicting
deviations from the long-term trend) are usually incorrect but valuable

See also [[id:b1449196-777e-4997-a786-d0a41ab761cd][How Governments Affect the Economic Cycle]] and [[id:3cc65406-58e5-4260-b463-93eef70a7d8e][How Central Banks Affect
the Economic Cycle]].

* Sources
- [[id:dd188129-5740-4141-a717-82796e10863b][Book: Mastering The Market Cycle]]
