content/posts/the_economic_cycle.md
+++
title = "The Economic Cycle"
author = ["Jethro Kuan"]
draft = false
+++

-   Currently in long-term secular uptrend because of:
    -   macro environment
    -   corporate growth
    -   the borrowing mentality
    -   popularization of investing
    -   investor psychology

The output of an economy is the product of **hours worked** and **rate of work
done**. These are affected by fundamental factors like birth rate which change
little from year to year.

Factors affecting short-term trend:

-   Willingness to work (market conditions etc.)
-   Fear of spending
-   Amount of wealth: consumers are unlikely to fund consumption by selling stocks or homes

Most economic forecasts are just extrapolations of current trends: they are
usually correct but not valuable. Unconventional forecasts (e.g. predicting
deviations from the long-term trend) are usually incorrect but valuable

See also [How Governments Affect the Economic Cycle]({{<relref "how_governments_affect_the_economic_cycle.md#" >}}) and [How Central Banks Affect
the Economic Cycle]({{<relref "how_central_banks_affect_the_economic_cycle.md#" >}}).


## Sources {#sources}

-   [Book: Mastering The Market Cycle]({{<relref "book_mastering_the_market_cycle.md#" >}})